3A/CS349/Animation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-24 Sat 01:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Animation</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Animation</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org351a65a">1. Frames and Frame Rate</a>
<ul>
<li><a href="#orgf48d8ef">1.1. Critical Flicker Frequency</a></li>
</ul>
</li>
<li><a href="#orgf8e31e4">2. Simulation</a></li>
<li><a href="#orgf2e5c9b">3. Timer</a></li>
<li><a href="#orgca74e16">4. Tweening</a>
<ul>
<li><a href="#org377ae00">4.1. lerp Function</a></li>
</ul>
</li>
<li><a href="#org57a86cf">5. Easing</a></li>
<li><a href="#org10caed4">6. Keyframes</a>
<ul>
<li><a href="#org872200c">6.1. Animation Manager</a></li>
<li><a href="#org797cff0">6.2. Keyframing</a></li>
</ul>
</li>
<li><a href="#org968f08c">7. System Timers and UI Threading</a>
<ul>
<li><a href="#org0cddb17">7.1. Built-in Timers</a></li>
<li><a href="#orgc4d41ae">7.2. Timers and UI Threading</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org351a65a" class="outline-2">
<h2 id="org351a65a"><span class="section-number-2">1.</span> Frames and Frame Rate</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Animation</b>: simulation of movement usind a series of images
</p>

<p>
<b>Frame</b>: each image or state of an animation sequence
</p>

<p>
<b>Frame rate</b>: number of frames to display per time period
</p>

<p>
<b>Tweening</b>: interpolation of key frames into frames
</p>

<p>
<b>Easing</b>: a function that controls how tweening is calculated
</p>

<p>
<b>Key Frame</b>: defines the beginning and ending of a tween
</p>

<p>
In UI programming, we animate numerical params that change how graphics are drawn over time:
</p>
<ul class="org-ul">
<li>params are related to tranformations (x, y, etc)</li>
<li>params can be anything numeric like fill or stroke weight</li>
<li>animating non-numeric values is possible but requires custom tweening</li>
</ul>

<p>
Frame rate is measured in FPS:
</p>
<ul class="org-ul">
<li>hand-drawn: 12-24</li>
<li>GIfs: 15-24</li>
<li>film: 24 or 60</li>
<li>legacy broadcast television: 30 for NTSC, 25 for PAL though each frame sent in 2 scanlines</li>
<li>computer displays and games: 60+</li>
<li>VR displays: 90, 120, or more</li>
</ul>
</div>
<div id="outline-container-orgf48d8ef" class="outline-3">
<h3 id="orgf48d8ef"><span class="section-number-3">1.1.</span> Critical Flicker Frequency</h3>
<div class="outline-text-3" id="text-1-1">
<p>
When perception of intermittent light source changes from flickering to continuous light,
typically around 60-90 Hz.
</p>
</div>
</div>
</div>
<div id="outline-container-orgf8e31e4" class="outline-2">
<h2 id="orgf8e31e4"><span class="section-number-2">2.</span> Simulation</h2>
<div class="outline-text-2" id="text-2">
<p>
Animation can be created through real-time simulation using functions, conditionals, etc.
This typically has no start and end, just loops or continues.
</p>
</div>
</div>
<div id="outline-container-orgf2e5c9b" class="outline-2">
<h2 id="orgf2e5c9b"><span class="section-number-2">3.</span> Timer</h2>
<div class="outline-text-2" id="text-3">
<p>
Timer is a simple kind of animation, which needs a duration, a start time, an update
function to check if timer is finished, a method to check if timer is running, and usually
a callback function to call when timer is finished.
</p>
</div>
</div>
<div id="outline-container-orgca74e16" class="outline-2">
<h2 id="orgca74e16"><span class="section-number-2">4.</span> Tweening</h2>
<div class="outline-text-2" id="text-4">
<p>
Interpolation between keyframes to create individual frames, where keyframes are considered
to be numeric values.
</p>

<p>
Tweening params:
</p>
<ul class="org-ul">
<li><code>startValue</code>: the starting value for the tween</li>
<li><code>endValue</code>: the ending value for the tween</li>
<li><code>duration</code>: the duration for the tween</li>
<li><code>startTime</code>: when the tween begins</li>
</ul>

<p>
Tweening calculation:
</p>
<ol class="org-ol">
<li>calculate proportion of time completed so far:
<code>t = (time - startTime) / duration</code></li>
<li>interpolate start and end value to get current tweened value:
<code>value = startValue + (endValue - startValue) * t</code></li>
</ol>
</div>
<div id="outline-container-org377ae00" class="outline-3">
<h3 id="org377ae00"><span class="section-number-3">4.1.</span> lerp Function</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<b>Linear interpolation</b>: smoothly interpolate changes from one value to another, a
fundamental part of animation tweening
</p>
</div>
</div>
</div>
<div id="outline-container-org57a86cf" class="outline-2">
<h2 id="org57a86cf"><span class="section-number-2">5.</span> Easing</h2>
<div class="outline-text-2" id="text-5">
<p>
Controls how tweening is calculated.
</p>

<p>
Lerp generates a linear change in value over time \(t\).
</p>

<p>
An easing function can change how value changes over time \(t\).
</p>

<p>
Some easing functions include flip (\(1-t\)), ease out, ease in, and ease in-out.
</p>
</div>
</div>
<div id="outline-container-org10caed4" class="outline-2">
<h2 id="org10caed4"><span class="section-number-2">6.</span> Keyframes</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org872200c" class="outline-3">
<h3 id="org872200c"><span class="section-number-3">6.1.</span> Animation Manager</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Some toolkits provide an animation manager that:
</p>
<ul class="org-ul">
<li>keep a list of active animations</li>
<li>update each animation every frame</li>
<li>remove animations when they finish</li>
</ul>

<p>
The programmer can set animation and not manage it themselves.
</p>
</div>
</div>
<div id="outline-container-org797cff0" class="outline-3">
<h3 id="org797cff0"><span class="section-number-3">6.2.</span> Keyframing</h3>
<div class="outline-text-3" id="text-6-2">
<p>
A tween is 2 keyframes, one at start time, start value and one at end time, end value.
</p>

<p>
This can be generalized to a sequence of keyframes that enables animations over time:
</p>
<ul class="org-ul">
<li>find two consecutive keyframes for current time and tween between them</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org968f08c" class="outline-2">
<h2 id="org968f08c"><span class="section-number-2">7.</span> System Timers and UI Threading</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org0cddb17" class="outline-3">
<h3 id="org0cddb17"><span class="section-number-3">7.1.</span> Built-in Timers</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Timer triggers an event after some time period:
</p>
<ol class="org-ol">
<li>set time period to time interval for desired frame rate</li>
<li>in the timer&rsquo;s finished event handler, update params to animate and optionally
redraw an updated image for the frame</li>
<li>restart timer for the next interval</li>
</ol>
</div>
</div>
<div id="outline-container-orgc4d41ae" class="outline-3">
<h3 id="orgc4d41ae"><span class="section-number-3">7.2.</span> Timers and UI Threading</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Most UI frameworks are single-threaded, because of simplicity and lack of need.
A single-threaded dispatch queue avoids deadlocks and race condtions due to
unpredictable user-generated events.
</p>

<p>
Most UI frameworks are not thread-safe to reduce execution burden and reduce
complexity.
</p>

<p>
Most modifications to UI must be on the UI execution thread, otherwise unexpected
behaviour.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-02-24 Sat 01:32</p>
</div>
</body>
</html>
